["```py\nfrom collections import Counter \nfrom string import punctuation\nfrom sklearn.feature_extraction.stop_words import ENGLISH_STOP_WORDS as stop_words\n```", "```py\n# https://www.cnn.com/2019/11/26/politics/judiciary-committee-hearing/index.html\n\ntext = \"\"\"\nThe House Judiciary Committee has invited President Donald Trump or his counsel to participate in the panel's first impeachment hearing next week as the House moves another step closer to impeaching the President. \nThe committee announced that it would hold a hearing December 4 on the \"constitutional grounds for presidential impeachment,\" with a panel of expert witnesses testifying.\nHouse Judiciary Chairman Jerry Nadler sent a letter to Trump on Tuesday notifying him of the hearing and inviting the President or his counsel to participate, including asking questions of the witnesses.\n\"I write to ask if you or your counsel plan to attend the hearing or make a request to question the witness panel,\" the New York Democrat wrote.\nIn the letter, Nadler said the hearing would \"serve as an opportunity to discuss the historical and constitutional basis of impeachment, as well as the Framers' intent and understanding of terms like 'high crimes and misdemeanors.' \"\n\"We expect to discuss the constitutional framework through which the House may analyze the evidence gathered in the present inquiry,\" Nadler added. \"We will also discuss whether your alleged actions warrant the House's exercising its authority to adopt articles of impeachment.\"\nThe Judiciary Committee hearing is the latest sign that House Democrats are moving forward with impeachment proceedings against the President following the two-month investigation led by the House Intelligence Committee into allegations that Trump pushed Ukraine to investigate his political rivals while a White House meeting and $400 million in security aid were withheld from Kiev.\nThe hearing announcement comes as the Intelligence Committee plans to release its report summarizing the findings of its investigation to the House Judiciary Committee soon after Congress returns from its Thanksgiving recess next week.\nDemocratic aides declined to say what additional hearings they will schedule as part of the impeachment proceedings.\nThe Judiciary Committee is expected to hold multiple hearings related to impeachment, and the panel would debate and approve articles of impeachment before a vote on the House floor.\nThe aides said the first hearing was a \"legal hearing\" that would include some history of impeachment, as well as evaluating the seriousness of the allegations and the evidence against the President.\nNadler asked Trump to respond by Sunday on whether the White House wanted to participate in the hearings, as well as who would act as the President's counsel for the proceedings. The letter was copied to White House Counsel Pat Cipollone.\n\"\"\"\n```", "```py\ndef tokenizer(s):\n    tokens = []\n    for word in s.split(' '):\n        tokens.append(word.strip().lower())\n    return tokens\n\ndef sent_tokenizer(s):\n    sents = []\n    for sent in s.split('.'):\n        sents.append(sent.strip())\n    return sents\n```", "```py\ntokens = tokenizer(text)\nsents = sent_tokenizer(text)\n\nprint(tokens)\nprint(sents)\n```", "```py\n['the', 'house', 'judiciary', 'committee', 'has', 'invited', 'president', 'donald', 'trump', 'or', 'his', 'counsel', 'to', 'participate', 'in', 'the', \"panel's\", 'first', 'impeachment', 'hearing', 'next', 'week', 'as', 'the', \n'house', 'moves', 'another', 'step', 'closer', 'to', 'impeaching', 'the', 'president.', 'the', 'committee', 'announced', 'that', 'it', 'would', 'hold', 'a', 'hearing', 'december', '4', 'on', 'the', '\"constitutional', 'grounds', 'for', \n\n...\n\n'the', 'white', 'house', 'wanted', 'to', 'participate', 'in', 'the', 'hearings,', 'as', 'well', 'as', 'who', 'would', 'act', 'as', 'the', \"president's\", 'counsel', 'for', 'the', 'proceedings.', 'the', 'letter', 'was', 'copied', 'to',\n'white', 'house', 'counsel', 'pat', 'cipollone.']\n\n[\"The House Judiciary Committee has invited President Donald Trump or his counsel to participate in the panel's first impeachment hearing next week as the House moves another step closer to impeaching the President\", 'The committee\nannounced that it would hold a hearing December 4 on the \"constitutional grounds for presidential impeachment,\" with a panel of expert witnesses testifying', 'House Judiciary Chairman Jerry Nadler sent a letter to Trump on Tuesday \n\n...\n\nseriousness of the allegations and the evidence against the President', \"Nadler asked Trump to respond by Sunday on whether the White House wanted to participate in the hearings, as well as who would act as the President's counsel for the\nproceedings\", 'The letter was copied to White House Counsel Pat Cipollone', '']\n\n```", "```py\ndef count_words(tokens):\n    word_counts = {}\n    for token in tokens:\n        if token not in stop_words and token not in punctuation:\n            if token not in word_counts.keys():\n                word_counts[token] = 1\n            else:\n                word_counts[token] += 1\n    return word_counts\n\nword_counts = count_words(tokens)\nword_counts\n```", "```py\n{'house': 10,\n 'judiciary': 5,\n 'committee': 7,\n 'invited': 1,\n 'president': 3,\n\n ...\n\n \"president's\": 1,\n 'proceedings.': 1,\n 'copied': 1,\n 'pat': 1,\n 'cipollone.': 1}\n\n```", "```py\ndef word_freq_distribution(word_counts):\n    freq_dist = {}\n    max_freq = max(word_counts.values())\n    for word in word_counts.keys():  \n        freq_dist[word] = (word_counts[word]/max_freq)\n    return freq_dist\n\nfreq_dist = word_freq_distribution(word_counts)\nfreq_dist\n```", "```py\n{'house': 1.0,\n 'judiciary': 0.5,\n 'committee': 0.7,\n 'invited': 0.1,\n 'president': 0.3,\n\n ...\n\n \"president's\": 0.1,\n 'proceedings.': 0.1,\n 'copied': 0.1,\n 'pat': 0.1,\n 'cipollone.': 0.1}\n\n```", "```py\ndef score_sentences(sents, freq_dist, max_len=40):\n    sent_scores = {}  \n    for sent in sents:\n        words = sent.split(' ')\n        for word in words:\n            if word.lower() in freq_dist.keys():\n                if len(words) < max_len:\n                    if sent not in sent_scores.keys():\n                        sent_scores[sent] = freq_dist[word.lower()]\n                    else:\n                        sent_scores[sent] += freq_dist[word.lower()]\n    return sent_scores\n\nsent_scores = score_sentences(sents, freq_dist)\nsent_scores\n```", "```py\n{\"The House Judiciary Committee has invited President Donald Trump or his counsel to participate in the panel's first impeachment hearing next week as the House moves another step closer to impeaching the President\": 6.899999999999999,\n 'The committee announced that it would hold a hearing December 4 on the \"constitutional grounds for presidential impeachment,\" with a panel of expert witnesses testifying': 2.8000000000000007,\n 'House Judiciary Chairman Jerry Nadler sent a letter to Trump on Tuesday notifying him of the hearing and inviting the President or his counsel to participate, including asking questions of the witnesses': 5.099999999999999,\n '\"I write to ask if you or your counsel plan to attend the hearing or make a request to question the witness panel,\" the New York Democrat wrote': 2.5000000000000004,\n 'In the letter, Nadler said the hearing would \"serve as an opportunity to discuss the historical and constitutional basis of impeachment, as well as the Framers\\' intent and understanding of terms like \\'high crimes and misdemeanors': 3.300000000000001,\n '\\' \"\\n\"We expect to discuss the constitutional framework through which the House may analyze the evidence gathered in the present inquiry,\" Nadler added': 2.7,\n '\"We will also discuss whether your alleged actions warrant the House\\'s exercising its authority to adopt articles of impeachment': 1.6999999999999997,\n 'The hearing announcement comes as the Intelligence Committee plans to release its report summarizing the findings of its investigation to the House Judiciary Committee soon after Congress returns from its Thanksgiving recess next week': 5.399999999999999,\n 'Democratic aides declined to say what additional hearings they will schedule as part of the impeachment proceedings': 1.3,\n 'The Judiciary Committee is expected to hold multiple hearings related to impeachment, and the panel would debate and approve articles of impeachment before a vote on the House floor': 4.300000000000001,\n 'The aides said the first hearing was a \"legal hearing\" that would include some history of impeachment, as well as evaluating the seriousness of the allegations and the evidence against the President': 2.8000000000000007,\n \"Nadler asked Trump to respond by Sunday on whether the White House wanted to participate in the hearings, as well as who would act as the President's counsel for the proceedings\": 3.5000000000000004,\n 'The letter was copied to White House Counsel Pat Cipollone': 2.2}\n```", "```py\ndef summarize(sent_scores, k):\n    top_sents = Counter(sent_scores) \n    summary = ''\n    scores = []\n\n    top = top_sents.most_common(k)\n    for t in top: \n        summary += t[0].strip()+'. '\n        scores.append((t[1], t[0]))\n    return summary[:-1], scores\n```", "```py\nsummary, summary_sent_scores = summarize(sent_scores, 3)\nprint(summary)\n```", "```py\nThe House Judiciary Committee has invited President Donald Trump or his \ncounsel to participate in the panel's first impeachment hearing next week as \nthe House moves another step closer to impeaching the President. The hearing \nannouncement comes as the Intelligence Committee plans to release its report \nsummarizing the findings of its investigation to the House Judiciary Committee \nsoon after Congress returns from its Thanksgiving recess next week. House \nJudiciary Chairman Jerry Nadler sent a letter to Trump on Tuesday notifying \nhim of the hearing and inviting the President or his counsel to participate, \nincluding asking questions of the witnesses.\n\n```", "```py\nfor score in summary_sent_scores: print(score[0], '->', score[1], '\\n')\n```", "```py\n6.899999999999999 -> The House Judiciary Committee has invited President \nDonald Trump or his counsel to participate in the panel's first impeachment \nhearing next week as the House moves another step closer to impeaching the President \n\n5.399999999999999 -> The hearing announcement comes as the Intelligence Committee \nplans to release its report summarizing the findings of its investigation to \nthe House Judiciary Committee soon after Congress returns from its Thanksgiving \nrecess next week \n\n5.099999999999999 -> House Judiciary Chairman Jerry Nadler sent a letter to \nTrump on Tuesday notifying him of the hearing and inviting the President or \nhis counsel to participate, including asking questions of the witnesses \n```"]