["```py\npip install pytube3\npip install openai \n```", "```py\nfrom pytube import YouTube\n\nvideo_url = \"https://www.youtube.com/watch?v=v6OB80Vt1Dk&t=1s&ab_channel=KevinStratvert\"\n\nyt = YouTube(video_url)\nstream = yt.streams.get_highest_resolution()\nstream.download()\n```", "```py\nimport openai\n\nAPI_KEY = 'your_api_key'\nmodel_id = 'whisper-1'\nlanguage = \"en\"\naudio_file_path = 'audio/5_tools_audio.mp4'\naudio_file = open(audio_file_path, 'rb')\n```", "```py\nresponse = openai.Audio.transcribe(\n    api_key=API_KEY,\n    model=model_id,\n    file=audio_file,\n    language='en'\n)\ntranscription_text = response.text\nprint(transcription_text)\n```", "```py\nHi everyone, Kevin here. Today, we're going to look at five different tools that leverage artificial intelligence in some truly incredible ways. Here for instance, I can change my voice in real time. I can also highlight an area of a photo and I can make that just automatically disappear. Uh, where'd my son go? I can also give the computer instructions, like, I don't know, write a song for the Kevin cookie company....\n```", "```py\naudio_file_path = 'audio/ml_in_python.mp4'\naudio_file = open(audio_file_path, 'rb')\n```", "```py\nresponse = openai.Audio.translate(\n    api_key=API_KEY,\n    model=model_id,\n    file=audio_file\n)\ntranslation_text = response.text\nprint(translation_text)\n```", "```py\nWe also see some graphs in a statistical style, so we should also understand how to read them. One is the box plot, which allows to see the distribution in terms of median, first quarter and third quarter. Now I'm going to tell you what it means. We always take the data from the data frame. X is the season. On Y we put the count of the bikes that are rented. And then I want to distinguish these box plots based on whether it is a holiday day or not. This graph comes out. How do you read this? Here on the X there is the season, coded in numerical terms. In blue we have the non-holiday days, in orange the holidays. And here is the count of the bikes. What are these rectangles? Take this box here. I'm turning it around with the mouse....\n```"]