["```py\nfrom textgenrnn import textgenrnn\ntextgen = textgenrnn()\ntextgen.train_from_file('trump-tweets.txt', num_epochs=10)\ntextgen.generate(5)\n\n```", "```py\n\nMy @FoxNews will be self finally complaining about me that so he is a great day and companies and is starting to report the president in safety and more than any mention of the bail of the underaches to the construction and freedom and efforts the politicians and expensive meetings should have bee\n\nThe world will be interviewed on @foxandfriends at 7:30pm. Enjoy!\n\n.@JebBush and Fake News Media is a major place in the White House in the service and sense where the people of the debate and his show of many people who is a great press considering the GREAT job on the way to the U.S. A the best and people in the biggest! Thank you!\n\nNew Hampshire Trump Int'l Hotel Leadership Barrier Lou Clinton is a forever person politically record supporters have really beginning in the media on the heart of the bad and women who have been succeeded and before you can also work the people are there a time strong and send out the world with \n\nJoin me in Maryland at 7:00 A.M. and happened to the WALL and be true the longer of the same sign into the Fake News Media will be a great honor to serve that the Republican Party will be a great legal rate the media with the Best Republican Party and the American people that will be the bill by a\n```", "```py\ntextgen.generate(5, temperature=0.9)\n\n```", "```py\n\n“Via-can see this Democrats were the opening at GREAT ENSUS CALL!\n\n.@GovSeptorald Taster is got to that the subcent Vote waiting them. @Calkers\n\nMajor President Obama will listen for the disaster!\n\nGrateful and South Carolina so his real ability and much better-- or big crisis on many signing!\n\nIt is absolutely dumbers for well tonight. Love us in the great inherition of fast. With bill of badly to forget the greatest puppet at my wedds. No Turnberry is \"bigger.” - Al\n\n```", "```py\ntextgen.generate(5, temperature=0.1)\n\n```", "```py\n\nThe Fake News Media is a great people of the president was a great people of the many people who would be a great people of the president was a big crowd of the statement of the media is a great people of the people of the statement of the people of the people of the world with the statement of th\n\nThank you @TrumpTowerNY #Trump2016 https://t.co/25551R58350\n\nThank you for your support! #Trump2016 https://t.co/7eN53P55c\n\nThe people of the U.S. has been a great people of the presidential country is a great time and the best thing that the people of the statement of the media is the people of the state of the best thing that the people of the statement of the statement of the problem in the problem and success and t\n\nThank you @TheBrodyFile tonight at 8:00 A.M. Enjoy!\n```"]